month = input("Введите месяц (от 1 до 12):")

#Проверка введенных данных без использования .isdigit()
proverka = ["1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12"]

while True:
    for i in proverka:
        if month == i:
            month = int(i)
            break
    if type(month) == str:
        month = input("Вы ввели неверные данные, введите месяц (от 1 до 12):")
    else:
        break

#решение через list
year_list = ["январь", "февраль", "март", "апрель", "май", "июнь", "июль", "август", "сентябрь", "октябрь", "ноябрь", "декабрь"]
print(f"Вы выбрали месяц: {year_list[month - 1]}")

#решение через dict
year_dict = {1 : "январь", 2 : "февраль", 3 : "март", 4 : "апрель", 5 : "май", 6 : "июнь", 7 : "июль", 8 : "август", 9 : "сентябрь", 10 : "октябрь", 11 : "ноябрь", 12 : "декабрь"}
print(f"Вы выбрали месяц: {year_dict.get(month)}")